pet_examples/evaluation/model_comp_corr/gpt3/graphviz/rulact_bpmn/10_6.gv
digraph G {
rankdir=LR;
start_1 -> task1[shape=rectangle ]
task1 -> seg_1[shape=diamond label="X"]
seg_1 -> task2[shape=rectangle label="Review dismissal (MSPO)"]
task2 -> spg_1[shape=diamond label="AND"]
spg_1 -> task3[shape=rectangle label="Reject dismissal (MSPO)"]
spg_1 -> task4[shape=rectangle label="Confirm dismissal (MSPO)"]
task3 -> mpg_1[shape=diamond label="AND"]
task4 -> mpg_1
mpg_1 -> end_1[shape=doublecircle label=""]
}
